# Boycotts

In [47]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib.patches as patches
import os.path

In [48]:
filepath = '../../data/Final/Country.csv'

In [49]:
if not os.path.exists( filepath ):
    print("Missing dataset file")
else:
    df = pd.read_csv(filepath , encoding = "ISO-8859-1")
    print("File Read")

File Read

In [50]:
df.head()

,Unnamed: 0,Country,Year,Host_City,Summer,NOC,Region,Gold,Silver,Bronze,Total_Medals,Ath_Rating,Gold_Share,Medal_Share,Rating_Share
0,0,Afghanistan,2008,Beijing,True,AFG,West and Central Asia,0,0,1,1,1,0.000000,0.001013,0.000516
1,1,Afghanistan,2012,London,True,AFG,West and Central Asia,0,0,1,1,1,0.000000,0.001003,0.000513
2,2,Algeria,1984,Los Angeles,True,ALG,North Africa,0,0,2,2,2,0.000000,0.002736,0.001384
3,3,Algeria,1992,Barcelone,True,ALG,North Africa,1,0,1,2,4,0.003546,0.002347,0.002372
4,4,Algeria,1996,Atlanta,True,ALG,North Africa,2,0,1,3,7,0.006944,0.003460,0.004060

# Identify Top 5

In [51]:
top = df.groupby(['Country'])[['Ath_Rating']].mean().sort_values('Ath_Rating',ascending=False).head(5).reset_index().Country.unique()
topFive = df[df.Country.isin(top)]
topFive = topFive[['Country','Summer','Year','Ath_Rating']]
topFive.head()

          Country  Summer  Year  Ath_Rating
311  East Germany   False  1968           7
312  East Germany    True  1968          49
313  East Germany    True  1972         133
314  East Germany   False  1972          20
315  East Germany   False  1976          31

# Group Rest By Region

In [52]:
df = df[['Country','Year','Summer','Region','Ath_Rating']]
df.head()

       Country  Year  Summer                 Region  Ath_Rating
0  Afghanistan  2008    True  West and Central Asia           1
1  Afghanistan  2012    True  West and Central Asia           1
2      Algeria  1984    True           North Africa           2
3      Algeria  1992    True           North Africa           4
4      Algeria  1996    True           North Africa           7

In [53]:
temp = df.groupby(['Region','Summer','Year'])[['Ath_Rating']].sum().reset_index()
temp['Country'] = 'Other '+temp['Region']
temp = temp[['Country','Summer','Year','Ath_Rating']]
temp.head()

                   Country  Summer  Year  Ath_Rating
0  Other Caribbean Islands    True  1960           1
1  Other Caribbean Islands    True  1964          11
2  Other Caribbean Islands    True  1968           8
3  Other Caribbean Islands    True  1972          17
4  Other Caribbean Islands    True  1976          39

# Output

In [62]:
output = pd.concat([topFive,temp])
output = output[output.Summer][['Country','Year','Ath_Rating']]
output.to_csv('../../data/Final/StreamSummer.csv',index =False)